        IDENTIFICATION DIVISION.
        PROGRAM-ID. PROGCOB01.
      **************************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTOR = THIAGO(SOUZA) - THIAGOS
      * OBJETIVO: MOSTRAR A STRING HELLO WORLD
      * DATA = XX/XX/XXXX
      **************************************
        ENVIRONMENT DIVISION.
        DATA DIVISION.
        PROCEDURE DIVISION.
            DISPLAY 'HELLO WORLD'.
            STOP RUN.
